const carbohydrates = {
  Фибри: [''],
  Нишесте: [''],
  Захари: [''],
  Галактоза: [''],
  Глюкоза: [''],
  Лактоза: [''],
  Малтоза: [''],
  Фруктоза: [''],
  Захароза: [''],
};
const fats = {
  ['Мононенаситени мазнини']:[''],
  ['Полиненаситени мазнини']:[''],
  ['Наситени мазнини']:[''],
  ['Трансмазнини']:['']
}
const aminoacids = {
  Аланин: [''],
  Аргинин: [''],
  ['Аспарагинова киселина']: [''],
  Валин: [''],
  Глицин: [''],
  Глутамин: [''],
  Изолевцин: [''],
  Левцин: [''],
  Лизин: [''],
  Метионин: [''],
  Пролин: [''],
  Серин: [''],
  Тирозин: [''],
  Треонин: [''],
  Триптофан: [''],
  Фенилаланин: [''],
  Хидроксипролин: [''],
  Хистидин: [''],
  Цистин: [''],
};

const minerals = {
  Желязо: [''],
  Калий: [''],
  Калций: [''],
  Магнезий: [''],
  Манган: [''],
  Мед: [''],
  Натрий: [''],
  Селен: [''],
  Флуорид: [''],
  Фосфор: [''],
  Цинк: [''],
};
const sterols = {
  Холестерол: [''],
  Фитостероли: [''],
  Стигмастероли: [''],
  Кампестероли: [''],
  ['Бета-ситостероли']: [''],
};
const vitamins = {
  Бетаин: [''],
  ['Витамин B3 (Ниацин)']: [''],
  ['Витамин B5 (Пантотенова киселина)']: [''],
  ['Витамин А']: [''],
  ['Витамин В1 (Тиамин)']: [''],
  ['Витамин B2 (Рибофлавин)']: [''],
  ['Витамин B4 (Холин)']: [''],
  ['Витамин B6 (Пиридоксин)']: [''],
  ['Витамин B9 (Фолиева киселина)']: [''],
  ['Витамин B12 (Кобалкамин)']: [''],
  ['Витамин C']: [''],
  ['Витамин D']: [''],
  ['Витамин E']: [''],
  ['Витамин K1']: [''],
  ['Витамин K2 (MK04)']: [''],
};
const more = {
  Алкохол: [''],
  Вода: [''],
  Кофеин: [''],
  Теобромин: [''],
  Пепел: [''],
};

const obj:any = {
    carbohydrates,
    aminoacids,
    vitamins,
    minerals,
    sterols,
    fats,
    more,
}

export function getNutrients(name: string) {
    return obj[name];
}
