using System.ComponentModel.DataAnnotations;

namespace StayFit.Shared.Enums
{
    public enum SubNutrientType
    {
        Фибри,
        Нишесте,
        Захари,
        Галактоза,
        Глюкоза,
        Захароза,
        Лактоза,
        Малтоза,
        Фруктоза,
        МононенаситениМазнини,
        ПолиненаситениМазнини,
        Трансмазнини,
        Бетаин,
        [Display(Name = "Витамин A")]
        ВитаминA,
        [Display(Name = "Витамин B1 (Тиамин)")]
        ВитаминB1,
        [Display(Name = "Витамин B2 (Рибофлавин)")]
        ВитаминB2,
        [Display(Name = "Витамин B3 (Ниацин)")]
        ВитаминB3,
        [Display(Name = "Витамин B4 (Холин)")]
        ВитаминB4,
        [Display(Name = "Витамин B5 (Пантотенова киселина)")]
        ВитаминB5,
        [Display(Name = "Витамин B6 (Пиридоксин)")]
        ВитаминB6,
        [Display(Name = "Витамин B9 (Фолиева киселина)")]
        ВитаминB9,
        [Display(Name = "Витамин B12 (Кобалкамин)")]
        ВитаминB12,
        [Display(Name = "Витамин C")]
        ВитаминC,
        [Display(Name = "Витамин D")]
        ВитаминD,
        [Display(Name = "Витамин E")]
        ВитаминE,
        [Display(Name = "Витамин K1")]
        ВитаминK1,
        [Display(Name = "Витамин K2 (MK04)")]
        ВитаминK2,
        Желязо,
        Калий,
        Калций,
        Магнезий,
        Манган,
        Мед,
        Натрий,
        Селен,
        Флуорид,
        Фосфор,
        Цинк,
        Аланин,
        Аргинин,
        [Display(Name = "Аспарагинова киселина")]
        АспарагиноваКиселина,
        Валин,
        Глицин,
        Глутамин,
        Изолевцин,
        Левцин,
        Лизин,
        Метионин,
        Пролин,
        Серин,
        Тирозин,
        Треонин,
        Триптофан,
        Фенилаланин,
        Хидроксипролин,
        Хистидин,
        Цистин,
        Холестерол,
        Фитостероли,
        Стигмастероли,
        Кампестероли,
        [Display(Name = "Бета-ситостероли")]
        БетаСитостероли,
        Алкохол,
        Вода,
        Кофеин,
        Теобромин,
        Пепел
    }
}
